
## Plan Result (prod_twingate)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 5 to add, 3 to change, 4 to destroy.</code></pre>

* Create
  * time_rotating.service_account_key_rotation
* Update
  * azurerm_key_vault_secret.service_account_key[&#34;AzureDevOps&#34;]
  * azurerm_key_vault_secret.service_account_key[&#34;Pelican&#34;]
  * azurerm_key_vault_secret.service_account_key[&#34;Pterodactyl&#34;]
* Replace
  * time_static.service_account_key_rotation


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.service_account_key["AzureDevOps"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "service_account_key" {
      ~ expiration_date         = "2026-01-02T22:08:38Z" -> (known after apply)
        id                      = "https://bancey-vault.vault.azure.net/secrets/Twingate-AzureDevOps-SA-Key/4f4a954c1d7a4a7b90ec17d6685a2932"
        name                    = "Twingate-AzureDevOps-SA-Key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (9 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.service_account_key["Pelican"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "service_account_key" {
      ~ expiration_date         = "2026-01-02T22:08:38Z" -> (known after apply)
        id                      = "https://bancey-vault.vault.azure.net/secrets/Twingate-Pelican-SA-Key/2eed76a9718e4e15a7db2a8f79ce3579"
        name                    = "Twingate-Pelican-SA-Key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (9 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.service_account_key["Pterodactyl"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "service_account_key" {
      ~ expiration_date         = "2026-01-02T22:08:38Z" -> (known after apply)
        id                      = "https://bancey-vault.vault.azure.net/secrets/Twingate-Pterodactyl-SA-Key/b4c1e0d64b324b04b4e9abb8ac309f1f"
        name                    = "Twingate-Pterodactyl-SA-Key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (9 unchanged attributes hidden)
    }

  # time_rotating.service_account_key_rotation will be created
  + resource "time_rotating" "service_account_key_rotation" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 7
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # time_static.service_account_key_rotation must be replaced
-/+ resource "time_static" "service_account_key_rotation" {
      ~ day     = 2 -> (known after apply)
      ~ hour    = 22 -> (known after apply)
      ~ id      = "2026-01-02T22:08:38Z" -> (known after apply)
      ~ minute  = 8 -> (known after apply)
      ~ month   = 1 -> (known after apply)
      ~ rfc3339 = "2026-01-02T22:08:38Z" -> (known after apply) # forces replacement
      ~ second  = 38 -> (known after apply)
      ~ unix    = 1767391718 -> (known after apply)
      ~ year    = 2026 -> (known after apply)
    }

  # twingate_service_account_key.this["AzureDevOps"] will be replaced due to changes in replace_triggered_by
-/+ resource "twingate_service_account_key" "this" {
      ~ id                 = "U2VydmljZUFjY291bnRLZXk6anFOMG5wemxRbl9qZl9OQXFPQ0JwaF9DcHZMVTF4TjJ5bkpIbEtQSUNYZw==" -> (known after apply)
      ~ is_active          = true -> (known after apply)
        name               = "AzureDevOps Key (auto rotates)"
      ~ token              = (sensitive value)
        # (2 unchanged attributes hidden)
    }

  # twingate_service_account_key.this["Pelican"] will be replaced due to changes in replace_triggered_by
-/+ resource "twingate_service_account_key" "this" {
      ~ id                 = "U2VydmljZUFjY291bnRLZXk6alNTMnN3UDh0MlFsODl2MkJxbTJ5cGJrUnhVR3hmRGtyWmF6RTIyQzZrRQ==" -> (known after apply)
      ~ is_active          = true -> (known after apply)
        name               = "Pelican Key (auto rotates)"
      ~ token              = (sensitive value)
        # (2 unchanged attributes hidden)
    }

  # twingate_service_account_key.this["Pterodactyl"] will be replaced due to changes in replace_triggered_by
-/+ resource "twingate_service_account_key" "this" {
      ~ id                 = "U2VydmljZUFjY291bnRLZXk6NnlZS29RZllJSEcxZVZKd3JLZDMzS2ZaVzFmbVJtbUY5eEswamNiQi1xRQ==" -> (known after apply)
      ~ is_active          = true -> (known after apply)
        name               = "Pterodactyl Key (auto rotates)"
      ~ token              = (sensitive value)
        # (2 unchanged attributes hidden)
    }

Plan: 5 to add, 3 to change, 4 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # time_rotating.service_account_key_rotation has been deleted
  - resource "time_rotating" "service_account_key_rotation" {
        id               = "2026-01-02T22:08:38Z"
      - rfc3339          = "2026-01-02T22:08:38Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":984,"Program":"tfcmt","SHA1":"","Target":"prod_twingate","Vars":{}} -->